//USERID      JOB USERID,'HJ',
//            CLASS=S,
//            MSGCLASS=R,
//            NOTIFY=&SYSUID,
//            TIME=1440,
//            REGION=0M,
//            LINES=(9999,WARNING)
//*------------------------------------------------------------------**
//* THIS IS FOR WHEN YOU WISH TO MERGE FILE A AND FILE B TO CREATE A NEW FILE
